<a href="https://colab.research.google.com/github/2303A51478/ADM/blob/main/LAB-04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [2]:
data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
          'Gender': ['Female', 'Male', 'Male', 'Male', 'Female'],
              'DOB': ['1990-05-15', '1985-10-22', '1992-07-08', '1988-03-25', '1995-12-30'],
                  'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
                      'Salary': [70000, 80000, 75000, 90000, 65000]
                      }

In [3]:
df = pd.DataFrame(data)

In [4]:

df['DOB'] = pd.to_datetime(df['DOB'])
df['Age'] = pd.Timestamp.now().year - df['DOB'].dt.year

In [5]:
label_encoder = LabelEncoder()
df['Gender_Label'] = label_encoder.fit_transform(df['Gender'])

In [6]:
df = pd.get_dummies(df, columns=['City'])

In [7]:
grouped_df = df.groupby('Gender')['Salary'].mean().reset_index()
print("Average Salary by Gender:")
print(grouped_df)

Average Salary by Gender:
   Gender        Salary
0  Female  67500.000000
1    Male  81666.666667

In [8]:
pivot_df = df.pivot_table(values='Salary', index='Gender', columns='Age', aggfunc='mean', fill_value=0)
print("\nPivot Table (Salary by Gender and Age):")
print(pivot_df)

Pivot Table (Salary by Gender and Age):
Age          30       33       35       37       40
Gender
Female  65000.0      0.0  70000.0      0.0      0.0
Male        0.0  75000.0      0.0  90000.0  80000.0

In [9]:
print("\nTransformed DataFrame:")
print(df)

Transformed DataFrame:
      Name  Gender        DOB  Salary  Age  Gender_Label  City_Chicago  \
0    Alice  Female 1990-05-15   70000   35             0         False
1      Bob    Male 1985-10-22   80000   40             1         False
2  Charlie    Male 1992-07-08   75000   33             1          True
3    David    Male 1988-03-25   90000   37             1         False
4      Eve  Female 1995-12-30   65000   30             0         False

   City_Houston  City_Los Angeles  City_New York  City_Phoenix
0         False             False           True         False
1         False              True          False         False
2         False             False          False         False
3          True             False          False         False
4         False             False          False          True